In [1]:
"""
Data Can be: Text, Image, Video, Audio, Tabular data etc.

Tabular data => Pandas DataFrame
Pandas: analyze, clean, explore, manipulate tabular data
"""

'\nData Can be: Text, Image, Video, Audio, Tabular data etc.\n\nTabular data => Pandas DataFrame\nPandas: analyze, clean, explore, manipulate tabular data\n'

In [2]:
import pandas as pd

In [3]:
health_data_table = {
    "height": [1.8, 1.6, 1.7, 1.9],
    "weight": [70, 60, 65, 80],
    "bmi": [21.6, 23.4, 22.5, None],
}

health_data_frame = pd.DataFrame(health_data_table)

print(type(health_data_frame))

<class 'pandas.core.frame.DataFrame'>

In [4]:
health_data_frame.head()  # first 5 rows

   height  weight   bmi
0     1.8      70  21.6
1     1.6      60  23.4
2     1.7      65  22.5
3     1.9      80   NaN

In [5]:
health_data_frame.head(2) #first 2 rows

   height  weight   bmi
0     1.8      70  21.6
1     1.6      60  23.4

In [6]:
health_data_frame.tail() #last 5 rows

   height  weight   bmi
0     1.8      70  21.6
1     1.6      60  23.4
2     1.7      65  22.5
3     1.9      80   NaN

In [7]:
health_data_frame.shape

(4, 3)

In [8]:
health_data_frame.info()  # info about the data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   height  4 non-null      float64
 1   weight  4 non-null      int64
 2   bmi     3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [9]:
health_data_frame.describe() # summary statistics of the data frame on numerical columns

         height     weight    bmi
count  4.000000   4.000000   3.00
mean   1.750000  68.750000  22.50
std    0.129099   8.539126   0.90
min    1.600000  60.000000  21.60
25%    1.675000  63.750000  22.05
50%    1.750000  67.500000  22.50
75%    1.825000  72.500000  22.95
max    1.900000  80.000000  23.40

In [10]:
values = health_data_frame.values  # get the values of the data frame as a numpy array
print(values)
print(type(values))

[[ 1.8 70.  21.6]
 [ 1.6 60.  23.4]
 [ 1.7 65.  22.5]
 [ 1.9 80.   nan]]
<class 'numpy.ndarray'>

In [11]:
cols = health_data_frame.columns
print(cols)

Index(['height', 'weight', 'bmi'], dtype='object')

In [12]:
health_data_frame.columns = ["Height(Feet)", "Weight(kg)", "BMI"]  # rename columns
print(health_data_frame.head())

   Height(Feet)  Weight(kg)   BMI
0           1.8          70  21.6
1           1.6          60  23.4
2           1.7          65  22.5
3           1.9          80   NaN

In [13]:
health_data_frame.to_csv(path_or_buf="data/health_data.csv", index=False)  # save the data frame to a csv file

In [34]:
my_health_data = pd.read_csv("data/health_data.csv")

In [35]:
my_health_data.head()

   Height(Feet)  Weight(kg)   BMI
0           1.8          70  21.6
1           1.6          60  23.4
2           1.7          65  22.5
3           1.9          80   NaN

In [36]:
df = pd.read_csv("data/homelessness.csv")

In [41]:
print(type(df))
df.head()

<class 'pandas.core.frame.DataFrame'>

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [ ]:
""" Sorting data
"""

sorted_df = df.sort_values(by=["region"]) 

sorted_df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
35,35,East North Central,Ohio,6929.0,3320.0,11676341
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
22,22,East North Central,Michigan,5209.0,3142.0,9984072
13,13,East North Central,Illinois,6752.0,3891.0,12723071
14,14,East North Central,Indiana,3776.0,1482.0,6695497

In [38]:
sorted_df = df.sort_values(by=["individuals"], ascending=False) 

sorted_df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
4,4,Pacific,California,109008.0,20964.0,39461588
32,32,Mid-Atlantic,New York,39827.0,52070.0,19530351
9,9,South Atlantic,Florida,21443.0,9587.0,21244317
43,43,West South Central,Texas,19199.0,6111.0,28628666
47,47,Pacific,Washington,16424.0,5880.0,7523869

In [19]:
sorted_df2 = df.sort_values(by=["region", "individuals"]) 
sorted_df2.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
14,14,East North Central,Indiana,3776.0,1482.0,6695497
22,22,East North Central,Michigan,5209.0,3142.0,9984072
13,13,East North Central,Illinois,6752.0,3891.0,12723071
35,35,East North Central,Ohio,6929.0,3320.0,11676341

In [ ]:
sorted_df3 = df.sort_values(by=["region"]) 
sorted_df3.head() #same region rows are sorted by random order

,Unnamed: 0,region,state,individuals,family_members,state_pop
35,35,East North Central,Ohio,6929.0,3320.0,11676341
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
22,22,East North Central,Michigan,5209.0,3142.0,9984072
13,13,East North Central,Illinois,6752.0,3891.0,12723071
14,14,East North Central,Indiana,3776.0,1482.0,6695497

In [ ]:
sorted_df4 = df.sort_values(by=["region", "individuals"]
    , ascending=[True, False] # ascending   descending
) 
sorted_df4.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
35,35,East North Central,Ohio,6929.0,3320.0,11676341
13,13,East North Central,Illinois,6752.0,3891.0,12723071
22,22,East North Central,Michigan,5209.0,3142.0,9984072
14,14,East North Central,Indiana,3776.0,1482.0,6695497
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406

In [40]:
individuals = df["individuals"]
print(type(individuals))
print(individuals)

<class 'pandas.core.series.Series'>
0       2570.0
1       1434.0
2       7259.0
3       2280.0
4     109008.0
5       7607.0
6       2280.0
7        708.0
8       3770.0
9      21443.0
10      6943.0
11      4131.0
12      1297.0
13      6752.0
14      3776.0
15      1711.0
16      1443.0
17      2735.0
18      2540.0
19      1450.0
20      4914.0
21      6811.0
22      5209.0
23      3993.0
24      1024.0
25      3776.0
26       983.0
27      1745.0
28      7058.0
29       835.0
30      6048.0
31      1949.0
32     39827.0
33      6451.0
34       467.0
35      6929.0
36      2823.0
37     11139.0
38      8163.0
39       747.0
40      3082.0
41       836.0
42      6139.0
43     19199.0
44      1904.0
45       780.0
46      3928.0
47     16424.0
48      1021.0
49      2740.0
50       434.0
Name: individuals, dtype: float64

In [ ]:
# Convert to numpy array
import numpy as np 
individuals = np.array(df["individuals"])
print(type(individuals))
print(individuals)

<class 'numpy.ndarray'>
[  2570.   1434.   7259.   2280. 109008.   7607.   2280.    708.   3770.
  21443.   6943.   4131.   1297.   6752.   3776.   1711.   1443.   2735.
   2540.   1450.   4914.   6811.   5209.   3993.   1024.   3776.    983.
   1745.   7058.    835.   6048.   1949.  39827.   6451.    467.   6929.
   2823.  11139.   8163.    747.   3082.    836.   6139.  19199.   1904.
    780.   3928.  16424.   1021.   2740.    434.]

In [ ]:
# Select columns
new_df = df[["region", "family_members"]]
print(new_df.head())

               region  family_members
0  East South Central           864.0
1             Pacific           582.0
2            Mountain          2606.0
3  West South Central           432.0
4             Pacific         20964.0

In [ ]:
# Select rows based on condition
mask = df["region"] == "Mountain" #Vectorization
df_mountain = df[mask]
print(df_mountain.head())

    Unnamed: 0    region     state  individuals  family_members  state_pop
2            2  Mountain   Arizona       7259.0          2606.0    7158024
5            5  Mountain  Colorado       7607.0          3250.0    5691287
12          12  Mountain     Idaho       1297.0           715.0    1750536
26          26  Mountain   Montana        983.0           422.0    1060665
28          28  Mountain    Nevada       7058.0           486.0    3027341

In [45]:
df_gt_10k = df[df["individuals"] > 10000]
print(df_gt_10k.head())

    Unnamed: 0              region       state  individuals  family_members  \
4            4             Pacific  California     109008.0         20964.0
9            9      South Atlantic     Florida      21443.0          9587.0
32          32        Mid-Atlantic    New York      39827.0         52070.0
37          37             Pacific      Oregon      11139.0          3337.0
43          43  West South Central       Texas      19199.0          6111.0

    state_pop
4    39461588
9    21244317
32   19530351
37    4181886
43   28628666

In [47]:
is_family_lt_10k_mask = df["family_members"] < 10000
is_region_pecific_mask = df["region"] == "Pacific"

df_pacific_lt_10k = df[is_family_lt_10k_mask & is_region_pecific_mask]
print(df_pacific_lt_10k.head())

    Unnamed: 0   region       state  individuals  family_members  state_pop
1            1  Pacific      Alaska       1434.0           582.0     735139
11          11  Pacific      Hawaii       4131.0          2399.0    1420593
37          37  Pacific      Oregon      11139.0          3337.0    4181886
47          47  Pacific  Washington      16424.0          5880.0    7523869

In [49]:
new_df = df.query("family_members < 10000 and region == 'Pacific'")
print(new_df.head())

    Unnamed: 0   region       state  individuals  family_members  state_pop  \
1            1  Pacific      Alaska       1434.0           582.0     735139
11          11  Pacific      Hawaii       4131.0          2399.0    1420593
37          37  Pacific      Oregon      11139.0          3337.0    4181886
47          47  Pacific  Washington      16424.0          5880.0    7523869

    total_pop
1    736573.0
11  1424724.0
37  4193025.0
47  7540293.0

In [48]:
df["total_pop"] = df["individuals"] + df["state_pop"]
print(df.head())

   Unnamed: 0              region       state  individuals  family_members  \
0           0  East South Central     Alabama       2570.0           864.0
1           1             Pacific      Alaska       1434.0           582.0
2           2            Mountain     Arizona       7259.0          2606.0
3           3  West South Central    Arkansas       2280.0           432.0
4           4             Pacific  California     109008.0         20964.0

   state_pop   total_pop
0    4887681   4890251.0
1     735139    736573.0
2    7158024   7165283.0
3    3009733   3012013.0
4   39461588  39570596.0

In [50]:
new_df.columns

Index(['Unnamed: 0', 'region', 'state', 'individuals', 'family_members',
       'state_pop', 'total_pop'],
      dtype='object')

In [51]:
new_df = new_df.drop(columns=["Unnamed: 0"])
print(new_df)

     region       state  individuals  family_members  state_pop  total_pop
1   Pacific      Alaska       1434.0           582.0     735139   736573.0
11  Pacific      Hawaii       4131.0          2399.0    1420593  1424724.0
37  Pacific      Oregon      11139.0          3337.0    4181886  4193025.0
47  Pacific  Washington      16424.0          5880.0    7523869  7540293.0

In [52]:
print("Mean: ", new_df["individuals"].mean())
print("Median: ", new_df["individuals"].median())
print("Max: ", new_df["individuals"].max())
print("Min: ", new_df["individuals"].min())
print("Sum: ", new_df["individuals"].sum())

Mean:  8282.0
Median:  7635.0
Max:  16424.0
Min:  1434.0
Sum:  33128.0

In [55]:
print(new_df[["individuals", "family_members"]].mean())
print(new_df[["individuals", "family_members"]].std())

individuals       8282.0
family_members    3049.5
dtype: float64
individuals       6796.580464
family_members    2206.512558
dtype: float64

In [59]:
def normalize1(col): #standardization
    mean = col.mean()
    std = col.std()
    normalized_col = (col - mean) / std

    return normalized_col

normalized_df1 = new_df[["individuals", "family_members"]].agg(normalize1)

print(normalized_df1.head())

    individuals  family_members
1     -1.007566       -1.118281
11    -0.610748       -0.294809
37     0.420358        0.130296
47     1.197955        1.282794

In [60]:
def normalize2(col): #min-max normalization
    min = col.min()
    max = col.max()
    normalized_col = (col-min)/(max-min)

    return normalized_col

normalized_df2 = new_df[["individuals", "family_members"]].agg(normalize2)

print(normalized_df2.head())

    individuals  family_members
1      0.000000        0.000000
11     0.179920        0.342960
37     0.647432        0.520008
47     1.000000        1.000000

In [61]:
normalized_df = new_df[["individuals", "family_members"]].agg([normalize1, normalize2])

print(normalized_df.head())

   individuals            family_members
    normalize1 normalize2     normalize1 normalize2
1    -1.007566   0.000000      -1.118281   0.000000
11   -0.610748   0.179920      -0.294809   0.342960
37    0.420358   0.647432       0.130296   0.520008
47    1.197955   1.000000       1.282794   1.000000

In [ ]:
new_df.value_counts("state")  # count of unique values(catagories) in each column

state
Alaska        1
Hawaii        1
Oregon        1
Washington    1
Name: count, dtype: int64

In [63]:
new_df.value_counts("region")

region
Pacific    4
Name: count, dtype: int64

In [64]:
new_df.value_counts(["state", "region"])

state       region
Alaska      Pacific    1
Hawaii      Pacific    1
Oregon      Pacific    1
Washington  Pacific    1
Name: count, dtype: int64

In [65]:
new_df.value_counts(["state", "region"], ascending=False)

state       region
Alaska      Pacific    1
Hawaii      Pacific    1
Oregon      Pacific    1
Washington  Pacific    1
Name: count, dtype: int64